#ifndef CTEXT_BLOCK_H
#define CTEXT_BLOCK_H

#include "CControl.h"
#include "CGlobal.h"
#include "CGameTime.h"
#include "CGraphics.h"

enum AnimationMode
{
	//-----------------------------------------------------------------------------
	// Chạy animation một lần duy nhất
	//-----------------------------------------------------------------------------
	ONCE,
	//-----------------------------------------------------------------------------
	// Chạy animation mãi mãi
	//-----------------------------------------------------------------------------
	FOREVER
};

//-----------------------------------------------------------------------------
// 	Canh lề chữ
//-----------------------------------------------------------------------------
enum Alignment
{
	//-----------------------------------------------------------------------------
	// 	Canh lề trái
	//-----------------------------------------------------------------------------
	LEFT,
	//-----------------------------------------------------------------------------
	// 	Canh lề phải
	//-----------------------------------------------------------------------------
	RIGHT,
	//-----------------------------------------------------------------------------
	// 	Canh lề trên
	//-----------------------------------------------------------------------------
	TOP,
	//-----------------------------------------------------------------------------
	// 	Canh lề dưới
	//-----------------------------------------------------------------------------
	BOTTOM,
	//-----------------------------------------------------------------------------
	// 	Canh lề giữa
	//-----------------------------------------------------------------------------
	CENTER
};

class CTextblock :public CControl
{
public:
	CTextblock();
	~CTextblock();

	//-----------------------------------------------------------------------------
	// 	Khởi tạo tất cả các thành phần của 1 đối tượng với các giá trí đã có
	//	
	//	Trả về 0 nếu lối hoặc 1 nếu thành công
	//-----------------------------------------------------------------------------
	int Initlize() override;

	//-----------------------------------------------------------------------------
	// 	Vẽ tất cả các thành phần của 1 đối tượng
	//	
	//	+ gameTime	: Thời gian cập nhật hệ thống
	//	+ graphics	: cọ vẽ đối tượng
	//-----------------------------------------------------------------------------
	void Render(CGameTime* gameTime, CGraphics* graphics) override;

	//-----------------------------------------------------------------------------
	// 	Cài đặt animation cho đoạn Text của label
	//	
	//	+ animationTime	: Thời gian thực hiện amimation, đơn vị (tick)
	//	+ animationMode	: chế độ thực hiện animation
	//-----------------------------------------------------------------------------
	void SetAnimation(float animationTime, AnimationMode animationMode);

	//-----------------------------------------------------------------------------
	// 	Dừng thực hiện Animation
	//-----------------------------------------------------------------------------
	void StopAnimation();

	bool GetAnimationState();

	//-----------------------------------------------------------------------------
	// Màu chữ
	//-----------------------------------------------------------------------------
	Color	_color;

	//-----------------------------------------------------------------------------
	// Mức độ scale cửa chữ
	//-----------------------------------------------------------------------------
	Vector2	_scale;

	//-----------------------------------------------------------------------------
	// Chỉ định canh lề ngang
	//-----------------------------------------------------------------------------
	Alignment _horizontalAlignment;

	//-----------------------------------------------------------------------------
	// Chỉ định canh lề dọc
	//-----------------------------------------------------------------------------
	Alignment _verticalAlignment;

	//-----------------------------------------------------------------------------
	// Nội dung đoạn text muốn hiển thị
	//-----------------------------------------------------------------------------
	string	_text;

private:
	float _tick;			// biến đếm thời gian cộng dồn, quản lý thời gian animation
	float _tickAnimation;	// biến đếm thời gian cộng dồn, hỗ trợ cho hiệu ứng nhấp nháy
	bool _isAnimation;		// Chỉ định hiệu ứng nhấp nháy
	float _animationTime;	//Thời gian thực hiện animation
	int _animationMode;		//Chế độ animation
	Rect _boundingRectText; // Khung hình chữ nhật bao đoạn text
};

#endif //!CTEXT_BLOCK_H